:PROPERTIES:
:ID:       94ed590e-4465-490e-8610-ae0393d91c27
:END:
#+TITLE: Building a data pipeline CLI
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I want to write a CLI that fetches CSV files from an SFTP server,
transforms them, and loads them into a database. It's Python, and I
need a reproducible environment where every developer on my team gets
the same Python version and the same pinned dependencies.

* Checking the Python version in the build environment

  My pipeline uses =match= statements, so I need Python 3.10+. Let me
  verify what Alpine gives me:

  #+NAME: python_version
  #+begin_src fixtureyaml
func: alpine-python
chain:
  - with-exec: [python3, -c, "import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')"]
  - stdout
  #+end_src

  #+RESULTS[7f27ff600bf18510ed9376e6622ece58dee5764f]: python_version
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-python with-exec --args="python3","-c","import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')" stdout
  #+end_src

  #+RESULTS[c52b7f53e6a3b31c1301aa64b5155c39ba539e67]:
  : 3.10+
  :end:

* Setting up the development container

  Each developer clones the repo and runs the pipeline locally. I need
  a container with Python, a virtualenv, and a non-root user — ready
  to =pip install -e .=. Running Python from the venv verifies both
  that the virtualenv exists and that the version is sufficient:

  #+NAME: alpine_venv
  #+begin_src fixtureyaml
func: alpine-python-user-venv
chain:
  - with-exec: [/app/venv/bin/python, -c, "import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')"]
  - stdout
  #+end_src

  #+RESULTS[e599bf4e09366931e15d6c7031573db2399ed1e7]: alpine_venv
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-python-user-venv with-exec --args="/app/venv/bin/python","-c","import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')" stdout
  #+end_src

  #+RESULTS[31983b8e1e01ef44c0992d246314e5c65dfaf091]:
  : 3.10+
  :end:

* Installing the pipeline's dependencies

  My pipeline depends on =requests= for the SFTP client wrapper. I
  can bake dependencies into the container image:

  #+NAME: venv_with_packages
  #+begin_src fixtureyaml
func: alpine-python-user-venv
args:
  pip-packages: [requests]
chain:
  - with-exec: [python3, -c, "import requests; print(requests.__name__)"]
  - stdout
  #+end_src

  #+RESULTS[23f822eed89c8fc9809e3c34506e6aad19986174]: venv_with_packages
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-python-user-venv --pip-packages=requests with-exec --args="python3","-c","import requests; print(requests.__name__)" stdout
  #+end_src

  #+RESULTS[1c3478a0450335a1b127fef0cd0570a05fe3692b]:
  : requests
  :end:

* When the pipeline needs native database drivers

  The load step uses =psycopg2= to talk to PostgreSQL. That requires
  =libpq-dev= and a C compiler, which are easier on Debian:

  #+NAME: debian_venv
  #+begin_src fixtureyaml
func: debian-python-user-venv
chain:
  - with-exec: [/app/venv/bin/python, -c, "import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')"]
  - stdout
  #+end_src

  #+RESULTS[07d3aecd8aabc6a076a33432a4dff729ace47c4e]: debian_venv
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call debian-python-user-venv with-exec --args="/app/venv/bin/python","-c","import sys; v=sys.version_info; print('3.10+' if v.major*100+v.minor >= 310 else 'too old')" stdout
  #+end_src

  #+RESULTS[491a255b16adfa994bfea7f16090aba240a977bb]:
  : 3.10+
  :end:

* Pinning dependencies with pip-tools

  I don't want surprise upgrades breaking the pipeline at 3am. I use
  =pip-compile= to lock all transitive dependencies:

  #+NAME: pip_tools
  #+begin_src fixtureyaml
func: pip-tools
chain:
  - with-exec: [which, pip-compile]
  - stdout
  #+end_src

  #+RESULTS[3d4f99572dedc99c5ea9309649872d1976a05339]: pip_tools
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call pip-tools with-exec --args="which","pip-compile" stdout
  #+end_src

  #+RESULTS[2253c8ef0c6afb76805b58dce010dadabb4f6a83]:
  : /home/sam/.local/bin/pip-compile
  :end:
